---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.SegmentsStartIsGreaterThanSegmentsEnd
source: html/7de40863-bce2-07fa-3695-e286d629bf3a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.SegmentsStartIsGreaterThanSegmentsEnd Property

Change values so Segments End is greater than or equal to Segments Start.

## Syntax (C#)
```csharp
public static FailureDefinitionId SegmentsStartIsGreaterThanSegmentsEnd { get; }
```